Config/Documents/РасшифровкаВнесенныхЧерезБанкоматСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасшифровкаВнесенныхЧерезБанкоматСредств</Name>
			<Comment>Расшифровка внесенных через банкомат неиспользованных наличных средств</Comment>
			<BasedOn>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииБанковскаяКарта</Name>
					<Comment>Вид операции (1- Взнос наличных, 2 - не использованные по карте)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодписьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Расходный кассовый ордер</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Лицевой счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФАИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.МероприятияПоИнформатизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодписьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Comment>КЭК</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассовыйСимвол</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСимволы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СостояниеПлатежноРасчетныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПлатежноРасчетныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Comment>Номер заявки кассового органа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации в кассовом органе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GUIDКО</Name>
					<Comment>Идентификатор документа в кассовом органе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйИсполнительДолжность</Name>
					<Comment>Ответственный исполнитель кассового органа должность </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйИсполнительФИО</Name>
					<Comment>Ответственный исполнитель кассового органа ФИО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйИсполнительТелефон</Name>
					<Comment>Ответственный исполнитель кассового органа телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПодтверждающегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждающегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПодтверждающегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Comment>Дата отражения документа в бюджетном учете</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИсполненияДокумента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПервичныйОбразИРеквизиты</Name>
					<Comment>Первичный образ и реквизиты переданные из кассового органа</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПлатежноРасчетныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыпискаИзЛицевогоСчетаУчреждения</v8:Type>
						<v8:Type>cfg:DocumentRef.КассовоеПоступление</v8:Type>
						<v8:Type>cfg:DocumentRef.РасшифровкаВнесенныхЧерезБанкоматСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаНаличныеБанковскаяКарта</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребование</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбУточненииВидаИПринадлежностиПлатежа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РСКПУточнение</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОВозвратеГИСГМПОтПодведомственного</v8:Type>
						<v8:Type>cfg:DocumentRef.Аккредитив</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбУточненииОперацийКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.КвитанцияНаОплатуГосуслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасходСокращенная</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходноеРасписание</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасход</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаНаличные</v8:Type>
						<v8:Type>cfg:DocumentRef.РСКППеречисление</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтПодведомственного</v8:Type>
						<v8:Type>cfg:DocumentRef.РСКППеречислениеМир</v8:Type>
						<v8:Type>cfg:DocumentRef.СводнаяЗаявкаНаКассовыйРасход</v8:Type>
						<v8:Type>cfg:DocumentRef.КассовоеВыбытие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОВозвратеГИСГМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаВыяснениеПринадлежностиПлатежа</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспоряжениеОПеречисленииНаКартыМир</v8:Type>
						<v8:Type>cfg:DocumentRef.КаталогГосУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаВыдачуКазначейскогоАккредитива</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОбОтказеОтАкцепта</v8:Type>
						<v8:Type>cfg:DocumentRef.РСКПВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаДляОбеспеченияНаличными</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросУНИФО</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтПосредникаГИСГМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСдачуПолучениеНаличных</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпискаИзЛицевогоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.БюджетныеДанные</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПродажуВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПокупкуВалюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/РасшифровкаВнесенныхЧерезБанкоматСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РасшифровкаВнесенныхЧерезБанкоматСредств";
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма0531251_22н";
	КомандаПечати.Представление = НСтр("ru = 'Расшифровка внесенных через банкомат средств (ф. 0531251)'");
	КомандаПечати.Порядок		= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РасшифровкаВнесенныхЧерезБанкоматСредств";
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма0531251";
	КомандаПечати.Представление = НСтр("ru = '(Устарела) Расшифровка внесенных через банкомат средств (ф. 0531251) (ред. 10н)'");
	КомандаПечати.Порядок		= 100;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.РасшифровкаВнесенныхЧерезБанкоматСредств";
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма0531846";
	КомандаПечати.Представление = НСтр("ru = '(Устарела) Расшифровка внесенных через банкомат средств (ф. 0531846)'");
	КомандаПечати.Порядок		= 100;
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531251_22н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531251_22н",
			"Расшифровка внесенных через банкомат средств",
			ПечатьРасшифровки(МассивОбъектов, ОбъектыПечати, "0531251"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531846") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531846",
			"Расшифровка внесенных через банкомат средств",
			ПечатьРасшифровки(МассивОбъектов, ОбъектыПечати, "0531846"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531251") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531251",
			"Расшифровка внесенных через банкомат средств",
			ПечатьРасшифровки(МассивОбъектов, ОбъектыПечати, "0531251_10н"));
	КонецЕсли;

КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции 

// Возвращает массив структур, содержащих значения реквизитов документа для выгрузки
//
// Параметры:
// МассивОбъектов               - Массив объектов данного вида
// ИспользоватьДопКл            - Признак применения доп. классификации и указании ее значений в структурах реквизитов документов
// ИспользоватьКодМероприятия   - Признак применения кодов мероприятий
// ИспользоватьКЭК              - Признак использования КЭК
// ИспользоватьАналитическийКод - Признак использования аналитического кода
// ИспользоватьКФО              - Признак применения КФО и указания значений КФО в структурах реквизитов документа
// ИспользоватьКОСГУПолучателя  - Признак использования КОСГУПолучателя
Функция ЗначенияРеквизитовДокумента(МассивОбъектов, ИспользоватьДопКл = Ложь, ИспользоватьКодМероприятия = Ложь, ИспользоватьКЭК = Ложь, ИспользоватьАналитическийКод = Ложь, ИспользоватьКФО = Ложь, ИспользоватьКОСГУПолучателя = Ложь) Экспорт  
	
	Возврат ПлатежноРасчетныеДокументы.ЗначенияРеквизитовРасшифровкаВнесенныхЧерезБанкоматСредств(МассивОбъектов, ИспользоватьДопКл, ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//  Возвращает сведения о записи в регистре сведенеий "СостояниеПлатежноРасчетныхДокументов"
//    Входящие параметры: Ссылка - тип ссылка на документ "Уведомление об уточнении операции клиента"
//    Исходящие параметры: 
Функция ПолучитьСостояниеДокумента(Ссылка) экспорт
	СтруктураРеквизитов = Новый Структура;
	ПоляВыборки = "";
	//  Струкутра реквизитов динамическая, т.к. со временем может понадобится новый ресурс в регистр
	//  что-бы его не забыть будем каждый раз перебирать ресурсы регистра
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СтруктураРеквизитов.Вставить(Ресурс.Имя);
		ПоляВыборки = ПоляВыборки + "
		|	Состояние." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", "
	КонецЦикла;	
	//  Добавка ввиде реквизита "ПервичныйОбразИРеквизиты"
	СтруктураРеквизитов.Вставить("ПервичныйОбразИРеквизиты");		
	ПоляВыборки = ПоляВыборки + "
	|	Состояние.ПервичныйОбразИРеквизиты КАК ПервичныйОбразИРеквизиты ";
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.РасшифровкаВнесенныхЧерезБанкоматСредств") тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
					|ИЗ	
					|	РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК Состояние
					|ГДЕ 
					|	Состояние.ПлатежноРасчетныйДокумент = &Ссылка";
						
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Для каждого КлючЗначение из СтруктураРеквизитов Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		СтруктураРеквизитов[ТекРеквизит] = Выборка[ТекРеквизит];
	КонецЦикла;	
		
	Возврат СтруктураРеквизитов;
КонецФункции	


Процедура ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, Область, ИсточникПараметров, ПоляПодвала, Шапка = Неопределено, ШапкаРаздела = Неопределено)  
	
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(Макет.ПолучитьОбласть(Область));
	ВыводимыеОбласти.Добавить(Макет.ПолучитьОбласть("Подвал"));
	ВыводимыеОбласти[0].Параметры.Заполнить(ИсточникПараметров);
	ВыводимыеОбласти[1].Параметры.Заполнить(ПоляПодвала);
	
	Попытка 
		Если НЕ ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
			ТабДокумент.Вывести(ВыводимыеОбласти[1]);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Если НЕ ШапкаРаздела = Неопределено Тогда
				ТабДокумент.Вывести(ШапкаРаздела);	
			КонецЕсли;	
			Если НЕ Шапка = Неопределено Тогда
				ТабДокумент.Вывести(Макет.ПолучитьОбласть(Шапка));	
			КонецЕсли;	
		КонецЕсли;
		ТабДокумент.Вывести(ВыводимыеОбласти[0]);
	Исключение
//		Сообщить("В системе не установлено ни одного принтера.");
	КонецПопытки;
	
КонецПроцедуры

Функция ПечатьРасшифровки(МассивОбъектов, ОбъектыПечати, НомерФормы)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы 					= ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб 						= Истина; 
    ТабДокумент.ВерхнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2; 
	ТабДокумент.НижнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасшифровкаВнесенныхЧерезБанкоматСредств";
	
	Если НомерФормы = "0531846" Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасшифровкаВнесенныхЧерезБанкоматСредств.ПФ_MXL_Форма0531846");
	ИначеЕсли НомерФормы = "0531251_10н" Тогда
	    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасшифровкаВнесенныхЧерезБанкоматСредств.ПФ_MXL_Форма0531251");
	ИначеЕсли НомерФормы = "0531251" Тогда
	    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасшифровкаВнесенныхЧерезБанкоматСредств.ПФ_MXL_Форма0531251_22н");	
	КонецЕсли;
	
	ДанныеДляПечатиМассив = ПлатежноРасчетныеДокументы.ЗначенияРеквизитовРасшифровкаВнесенныхЧерезБанкоматСредств(МассивОбъектов);

	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеДляПечати Из ДанныеДляПечатиМассив Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// вывод в табличный документ
		ОбластьВывода = Макет.ПолучитьОбласть("Заголовок");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		
		// дальше надо смотреть, умещается ли на страницу
		// Раздел 1
		ШапкаРаздела 			= Макет.ПолучитьОбласть("Шапка");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "1");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ШапкаРаздела);
		
		Для Каждого СтрВыборка Из ДанныеДляПечати.Расшифровка Цикл 
			Если не ЗначениеЗаполнено(СтрВыборка.ВидСредств) тогда
				СтрВыборка.ВидСредств = ДанныеДляПечати.ВидСредств;
			КонецЕсли;	
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Расшифровка", СтрВыборка, ДанныеДляПечати, "Шапка", ШапкаРаздела);  
		КонецЦикла;
		
		ОбластьВывода = Макет.ПолучитьОбласть("ШапкаПодвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		
		
		// последняя подпись ответственного исполнителя 
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		//ОбластьВывода.Области.ОбластьМестоПечати.Текст = "М.П.";
		ТабДокумент.Вывести(ОбластьВывода);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;

КонецФункции	

#КонецОбласти

#КонецЕсли
